{
  "loss": "mse",
  "optimizer": {
    "beta_1": 0.8999999761581421,
    "epsilon": 1e-8,
    "beta_2": 0.9990000128746033,
    "lr": 0.0010000000474974513,
    "name": "Adam"
  },
  "class_name": "Sequential",
  "keras_version": "1.0.6",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "b_constraint": null,
        "name": "dense_1",
        "output_dim": 12,
        "activity_regularizer": null,
        "trainable": true,
        "init": "glorot_uniform",
        "bias": true,
        "input_dtype": "float32",
        "input_dim": 4,
        "b_regularizer": null,
        "W_regularizer": null,
        "activation": "relu",
        "batch_input_shape": [
          null,
          4
        ]
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "b_constraint": null,
        "name": "dense_2",
        "activity_regularizer": null,
        "trainable": true,
        "init": "glorot_uniform",
        "bias": true,
        "input_dim": null,
        "b_regularizer": null,
        "W_regularizer": null,
        "activation": "relu",
        "output_dim": 12
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "W_constraint": null,
        "b_constraint": null,
        "name": "dense_3",
        "activity_regularizer": null,
        "trainable": true,
        "init": "glorot_uniform",
        "bias": true,
        "input_dim": null,
        "b_regularizer": null,
        "W_regularizer": null,
        "activation": "linear",
        "output_dim": 2
      }
    }
  ],
  "sample_weight_mode": null
}
